In [5]:
import pandas as pd
import numpy as np

In [6]:
pd.Series()

Series([], dtype: float64)

In [11]:
n = np.random.randint(10,20, (5,5))

In [12]:
ind =  np.random.randint(50,100, (5,))

In [13]:
cols = ["A", "B", "C", "D", "E"]

In [14]:
ind, cols

(array([79, 76, 67, 72, 82]), ['A', 'B', 'C', 'D', 'E'])

In [15]:
pd.DataFrame(n , index = ind, columns = cols)

     A   B   C   D   E
79  16  11  17  17  18
76  11  10  18  18  16
67  11  13  14  11  12
72  17  13  15  12  15
82  13  19  19  13  13

In [16]:
names = ["Anuj", "Naman", "Mohit"]
ages = [26, 21, 28]

In [17]:
d = {"names": names, "ages" : ages}

In [18]:
d

{'names': ['Anuj', 'Naman', 'Mohit'], 'ages': [26, 21, 28]}

In [19]:
li = [{"name":"Anuj", "age" : 26}, {"name":"Mohit","age":39}]

In [40]:
df = pd.DataFrame(li)

In [41]:
df.to_csv("hello.csv", index=False)

In [42]:
df.to_excel("hello.xls")

In [43]:
df.age

0    26
1    39
Name: age, dtype: int64

In [44]:
pd.DataFrame(names)

       0
0   Anuj
1  Naman
2  Mohit

In [47]:
df.iloc[]

   age   name
0   26   Anuj
1   39  Mohit

In [48]:
df.iloc[0:]

   age   name
0   26   Anuj
1   39  Mohit

In [51]:
df.info

<bound method DataFrame.info of    age   name
0   26   Anuj
1   39  Mohit>

In [52]:
df.describe

<bound method NDFrame.describe of    age   name
0   26   Anuj
1   39  Mohit>

In [58]:
pd.date_range('20200312', periods = 6)

DatetimeIndex(['2020-03-12', '2020-03-13', '2020-03-14', '2020-03-15',
               '2020-03-16', '2020-03-17'],
              dtype='datetime64[ns]', freq='D')

In [60]:
np.random.randn(6,4)

array([[ 1.20701986,  0.81588426, -0.33161379,  1.11439131],
       [-0.62754399,  0.68939847,  1.1282754 ,  0.85616407],
       [-0.79731186, -0.71682428, -0.18743279,  1.68245949],
       [-0.71761748, -0.20068209, -1.5119324 , -0.46438286],
       [-0.42497416,  0.77961947, -0.63993074,  1.569336  ],
       [ 0.75191936,  0.49237095, -0.26768264,  0.44454848]])

In [62]:
pd.Timestamp?

Init signature:
pd.Timestamp(
    ts_input=<object object at 0x7fd92aeb84f0>,
    freq=None,
    tz=None,
    unit=None,
    year=None,
    month=None,
    day=None,
    hour=None,
    minute=None,
    second=None,
    microsecond=None,
    nanosecond=None,
    tzinfo=None,
)
Docstring:
Pandas replacement for datetime.datetime

Timestamp is the pandas equivalent of python's Datetime
and is interchangeable with it in most cases. It's the type used
for the entries that make up a DatetimeIndex, and other timeseries
oriented data structures in pandas.

Parameters
----------
ts_input : datetime-like, str, int, float
    Value to be converted to Timestamp
freq : str, DateOffset
    Offset which Timestamp will have
tz : str, pytz.timezone, dateutil.tz.tzfile or None
    Time zone for time which Timestamp will have.
unit : str
    Unit used for conversion if ts_input is of type int or float. The
    valid values are 'D', 'h', 'm', 's', 'ms', 'us', and 'ns'. For
    example, 's' means seconds and 'ms' means milliseconds.
year, month, day : int
    .. versionadded:: 0.19.0
hour, minute, second, microsecond : int, optional, default 0
    .. versionadded:: 0.19.0
nanosecond : int, optional, default 0
    .. versionadded:: 0.23.0
tzinfo : datetime.tzinfo, optional, default None
    .. versionadded:: 0.19.0

Notes
-----
There are essentially three calling conventions for the constructor. The
primary form accepts four parameters. They can be passed by position or
keyword.

The other two forms mimic the parameters from ``datetime.datetime``. They
can be passed by either position or keyword, but not both mixed together.

Examples
--------
Using the primary calling convention:

This converts a datetime-like string
>>> pd.Timestamp('2017-01-01T12')
Timestamp('2017-01-01 12:00:00')

This converts a float representing a Unix epoch in units of seconds
>>> pd.Timestamp(1513393355.5, unit='s')
Timestamp('2017-12-16 03:02:35.500000')

This converts an int representing a Unix-epoch in units of seconds
and for a particular timezone
>>> pd.Timestamp(1513393355, unit='s', tz='US/Pacific')
Timestamp('2017-12-15 19:02:35-0800', tz='US/Pacific')

Using the other two forms that mimic the API for ``datetime.datetime``:

>>> pd.Timestamp(2017, 1, 1, 12)
Timestamp('2017-01-01 12:00:00')

>>> pd.Timestamp(year=2017, month=1, day=1, hour=12)
Timestamp('2017-01-01 12:00:00')
File:           ~/anaconda3/lib/python3.7/site-packages/pandas/_libs/tslibs/timestamps.cpython-37m-x86_64-linux-gnu.so
Type:           type
Subclasses:

In [63]:
list(range(4))

[0, 1, 2, 3]

In [64]:
df.head()

   age   name
0   26   Anuj
1   39  Mohit

In [66]:
dates = pd.date_range('20130101', periods=6)

df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [67]:
df

                   A         B         C         D
2013-01-01 -0.832487 -0.031069 -0.710195 -0.026985
2013-01-02 -0.936146  1.301660 -0.014621  1.659180
2013-01-03 -1.754629  0.004097  1.028573  0.606466
2013-01-04 -0.086395 -0.366932  1.674922  0.353829
2013-01-05 -0.259843 -0.099027  0.945178  0.851702
2013-01-06 -0.460358 -0.877925 -0.055889  0.218897

In [68]:
df.head()

                   A         B         C         D
2013-01-01 -0.832487 -0.031069 -0.710195 -0.026985
2013-01-02 -0.936146  1.301660 -0.014621  1.659180
2013-01-03 -1.754629  0.004097  1.028573  0.606466
2013-01-04 -0.086395 -0.366932  1.674922  0.353829
2013-01-05 -0.259843 -0.099027  0.945178  0.851702

In [69]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [73]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06 -0.460358 -0.877925 -0.055889  0.218897
2013-01-05 -0.259843 -0.099027  0.945178  0.851702
2013-01-04 -0.086395 -0.366932  1.674922  0.353829
2013-01-03 -1.754629  0.004097  1.028573  0.606466
2013-01-02 -0.936146  1.301660 -0.014621  1.659180
2013-01-01 -0.832487 -0.031069 -0.710195 -0.026985

In [74]:
length = 10
breath = 10

area = length * breath

In [75]:
print (area)

100

In [76]:
perimeter = 2*(length+breath)

In [77]:
print(perimeter)

40

In [81]:
print("Area is {} and permiter is {}".format(area,perimeter))

Area is 100 and permiter is 40

In [82]:
n=5
for i in range(n):
    print(i)

0
1
2
3
4

In [116]:
n = 5

for i in range(1,n+1):
        if i>1:
            for j in range(2,i):
                if (i%j) == 0:
                    break   
            else:
                print(i)

2
3
5

In [111]:
start = 1
end = 29
  
for val in range(start, end + 1): 
      
   # If num is divisible by any number   
   # between 2 and val, it is not prime  
   if val > 1: 
       for n in range(2, val): 
           if (val % n) == 0: 
               break
       else: 
           print(val)

2
3
5
7
11
13
17
19
23
29

In [119]:
a="The school is this"

a.find?

Docstring:
S.find(sub[, start[, end]]) -> int

Return the lowest index in S where substring sub is found,
such that sub is contained within S[start:end].  Optional
arguments start and end are interpreted as in slice notation.

Return -1 on failure.
Type:      builtin_function_or_method

In [120]:
2//2

1

In [121]:
d = {"Apple" : 10, "Banana":20}

In [122]:
d

{'Apple': 10, 'Banana': 20}

In [123]:
d["Apple"]

10

In [130]:
for i in d.values():
    print(i)

10
20

In [135]:
a = [2,3,4]

def test(*args,**kwargs):
    print(kargs)
    
test(**a)

TypeError: test() argument after ** must be a mapping, not list